catapultcase/JunctionRelay_P4_DSI_Test/sdkconfig.defaults
# ESP32-P4-Nano DSI Configuration - Fixed Memory Issues
CONFIG_IDF_TARGET="esp32p4"

# PSRAM Configuration - CRITICAL for DSI frame buffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Additional PSRAM settings for large frame buffers
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

# BSP Display Configuration
CONFIG_BSP_DISPLAY_DSI_HX8394=y
CONFIG_BSP_DISPLAY_COLOR_FORMAT_RGB565=y
CONFIG_BSP_DSI_LANE_BITRATE_MBPS=1000

# Memory and heap settings
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# Flash configuration  
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20